# Практичні завдання до 3-ї лекції
# Завдання 1: Парне чи непарне число
# Опис: Напишіть програму, яка запитує у користувача число і визначає, чи є це число парним або непарним.
# Використовуйте input() для введення числа.
# Використовуйте if-else для перевірки парності.
# Завдання 2: Випадкове число і вгадування
# Опис: Створіть програму, яка генерує випадкове число від 1 до 10, а потім запитує користувача, щоб він спробував його вгадати. Програма повинна виводити повідомлення “Забагато“, “Замало” або “Вгадали!“.
# Використовуйте random.randint() для генерації числа.
# Використовуйте цикл while для повторення спроб.

# Завдання 3: Перевірка віку
# Опис: Напишіть програму, яка запитує у користувача вік і виводить повідомлення про те, чи може він отримати водійське посвідчення. Якщо вік менше 18, програма повинна запропонувати зачекати до досягнення потрібного віку.
# Використовуйте input() для введення віку.
# Використовуйте if-else для перевірки віку.

# Завдання 4: Простий калькулятор
# Опис: Напишіть програму-калькулятор, яка приймає два числа і запитує у користувача операцію: додавання, віднімання, множення або ділення, і виводить результат.
# Використовуйте input() для введення чисел та операції.
# Використовуйте if-elif-else для вибору операції.


# num1 = float(input("введите первое числло: "))
# num2 = float(input("введите второе числло: "))
# operator = input("выберите действие (+,-,*,/): ")
# if operator == "+":
#     print(f"Результат: {num1 + num2}")
# elif operator == "-":
#     print(f"Результат: {num1 - num2}")
# elif operator == "*":
#     print(f"Результат: {num1 * num2}")
# elif operator == "/":
#     print(f"Результат: {num1 / num2}")
# else:
#     print("введите коректную информацию:")


# Завдання 5: Лічильник слів
# Опис: Напишіть програму, яка запитує у користувача рядок і виводить кількість elem у цьому рядку.
# Використовуйте input() для введення рядка.
# Використовуйте цикл while для підрахунку.

# text = input("Введите текст: ")
# count = 0
# count2 = len(text)
# while count != count2: 
#     count += 1
# print(f"коичество символов: {count}")



# Завдання 6: Гра “Число від 1 до 100”
# Опис: Напишіть програму, яка генерує випадкове число від 1 до 100, і користувач має вгадати це число. Після кожної спроби програма повинна повідомляти, чи правильне число більше або менше.
# Використовуйте random.randint(), input(), цикл while, та умови if-else.


# import random
# random_num = random.randint(1,100)
# while True: 
#     user_num = int(input("введите число от 1 до 100: "))
#     if user_num == random_num :
#         print("вгадалы")
#         break
#     elif user_num > random_num :
#         print("Много")
#     else:
#         print("Мало")


# Завдання 7: Простий рахунок до 10
# Опис: Напишіть програму, яка використовує цикл while, щоб вивести числа від 1 до 10. Кожне число має виводитися на новому рядку.

# count = 1
# while count <= 10 :
#     print(count)
#     count += 1


# Завдання 8: Перевірка пароля
# Опис: Напишіть програму, яка запитує у користувача пароль. Якщо введений пароль правильний, програма вітає користувача. Якщо пароль неправильний, програма пропонує ввести його знову. Програма завершується після трьох невдалих спроб.

# count = 1
# password = 123
# while count <= 3:
#     user_pass = int(input("Введите пароль: ")) 
#     if user_pass == password:
#         print("Пароль верный")
#         break
#     else:
#         print("Пароль не правельный")
#         count += 1

# Завдання 9: Число в діапазоні
# Опис: Напишіть програму, яка запитує у користувача число і перевіряє, чи входить воно в заданий діапазон (наприклад, від 10 до 20 включно). Якщо число не входить у цей діапазон, програма пропонує ввести його знову, поки не буде введено правильне число.

# while True:
#     num = int(input("Введите число : "))
#     if 10 <= num <= 20 :
#         print(f"Число {num} в диапозоне")
#         break
#     else:
#         print(f"число {num} не в диапозоне, попробуйьте еще")
        
# Завдання 10: Перевірка на високий бал
# Опис: Напишіть програму, яка запитує у користувача його оцінку за тест. Якщо оцінка вище 90, програма виводить повідомлення “Відмінно!“. Якщо оцінка від 70 до 90, виводиться “Добре!“. Якщо менше 70 — “Потрібно більше попрацювати!“.

# num = int(input("Введите ваш балл: "))
# if num > 90 :
#     print("Отлично")
# elif  70 <= num <= 90:
#     print("Хорошо")
# else:
#     print("Учись лучше")

# Завдання 11: Користувацьке число та випадкове
# Опис: Напишіть програму, яка запитує у користувача число від 1 до 10, а потім порівнює його з випадковим числом у цьому ж діапазоні, згенерованим програмою. Якщо числа співпадають — програма вітає користувача з вгадуванням. Інакше програма виводить обидва числа та повідомляє про програш.

# import random
# random_num = random.randint(1,10)
# num_usser = int(input("ВВЕДИ ЧИСЛО ОТ 1 ДО 10: "))
# if num_usser == random_num:
#     print("Поздравляю")
# else:
#     print(f"ваше число: {num_usser} правильное число: {random_num} вы проиграли")


